"""
Создайте функцию которая принимает на вход 3 именованных параметра, выведите на печать значения этих параметров,
но только в том случае если они не равны None.
"""
def kat(a, s, d):
    if a != None and s != None and d != None:
        print(a, s, d)
kat(2, 22,1)

